/* eslint-disable react/prop-types */
/* eslint-disable no-unused-vars */
import React from "react";

import { Swiper, SwiperSlide } from "swiper/react";
import { Autoplay, Pagination, Navigation } from "swiper/modules";

// Import Swiper styles
import "swiper/css";
import "swiper/css/pagination";
import "swiper/css/navigation";

import "./Services.css";

const iconDesignIdeas = (
    <svg
        xmlns="http://www.w3.org/2000/svg"
        width="80"
        height="80"
        viewBox="0 0 80 80"
        fill="none"
    >
        <path
            d="M35 54.865C33.2667 54.6727 31.5617 54.2784 29.92 53.69C29.97 52.51 30 51.28 30 50V48.315C31.55 49.055 33.235 49.57 35 49.825V37.5C35 35.5109 35.7902 33.6032 37.1967 32.1967C38.6032 30.7902 40.5109 30 42.5 30H54.825C54.4263 27.2294 53.3687 24.5949 51.7412 22.3176C50.1137 20.0403 47.9636 18.1866 45.4715 16.9121C42.9793 15.6377 40.2178 14.9796 37.4188 14.9931C34.6197 15.0067 31.8647 15.6915 29.385 16.99C28.9895 15.3547 28.3381 13.7921 27.455 12.36C30.6963 10.7421 34.2804 9.93085 37.9025 9.99512C41.5247 10.0594 45.0777 10.9973 48.2596 12.7292C51.4415 14.461 54.1582 16.9355 56.1787 19.9424C58.1992 22.9493 59.4638 26.3996 59.865 30H67.5C69.4891 30 71.3968 30.7902 72.8033 32.1967C74.2098 33.6032 75 35.5109 75 37.5V62.5C75 64.4891 74.2098 66.3968 72.8033 67.8033C71.3968 69.2098 69.4891 70 67.5 70H42.5C40.5109 70 38.6032 69.2098 37.1967 67.8033C35.7902 66.3968 35 64.4891 35 62.5V54.865ZM59.865 35C59.2969 40.073 57.0214 44.8022 53.4118 48.4118C49.8022 52.0214 45.073 54.2969 40 54.865V62.5C40 63.1631 40.2634 63.7989 40.7322 64.2678C41.2011 64.7366 41.837 65 42.5 65H67.5C68.163 65 68.7989 64.7366 69.2678 64.2678C69.7366 63.7989 70 63.1631 70 62.5V37.5C70 36.837 69.7366 36.2011 69.2678 35.7322C68.7989 35.2634 68.163 35 67.5 35H59.865ZM54.825 35H42.5C41.837 35 41.2011 35.2634 40.7322 35.7322C40.2634 36.2011 40 36.837 40 37.5V49.825C43.7399 49.2844 47.2046 47.5485 49.8765 44.8765C52.5485 42.2046 54.2844 38.7399 54.825 35ZM23.975 37.805C23.45 35.875 22.6 33.94 21.14 32.455C23.5 30.22 25 26.66 25 22.5C25 19.015 24.295 16.62 23.02 14.705C22.4543 13.8814 21.8004 13.1219 21.07 12.44C20.7901 12.1698 20.5067 11.9031 20.22 11.64C19.915 11.355 19.635 11.095 19.27 10.73C18.52 9.98001 18.435 9.38001 18.435 9.06501C18.4358 8.88992 18.4645 8.71608 18.52 8.55001C18.7486 8.05564 18.8095 7.50014 18.6934 6.96798C18.5774 6.43583 18.2907 5.95614 17.877 5.60186C17.4633 5.24758 16.9452 5.0381 16.4015 5.00528C15.8578 4.97245 15.3183 5.11808 14.865 5.42001L14.855 5.42501L14.84 5.43501L14.795 5.46501L14.645 5.56501C13.895 6.09997 13.1724 6.67236 12.48 7.28001C11.23 8.38501 9.6 10.02 8.445 11.97C7.43675 13.5867 6.62755 15.3192 6.035 17.13C5.435 18.925 5 20.87 5 22.5C5 26.66 6.5 30.215 8.86 32.46C7.4 33.94 6.55 35.875 6.025 37.81C5 41.57 5 46.22 5 49.815V50C5 60.29 6.925 66.4 9.105 70.035C10.2 71.855 11.34 73.03 12.295 73.77C12.8039 74.1669 13.3577 74.5026 13.945 74.77C14.2847 74.894 14.6396 74.9714 15 75C15.42 75 16.055 74.77 16.055 74.77C16.6423 74.5026 17.1961 74.1669 17.705 73.77C18.655 73.03 19.805 71.855 20.895 70.035C23.075 66.405 25 60.29 25 50V49.82C25 46.22 25 41.575 23.975 37.805ZM12.435 35.955C13 35.385 13.755 35 15 35C16.25 35 17 35.39 17.565 35.95C18.195 36.585 18.74 37.615 19.15 39.12C19.98 42.175 20 46.185 20 50C20 59.71 18.175 64.85 16.605 67.465C16.005 68.465 15.44 69.11 15 69.515C14.3713 68.9105 13.831 68.2204 13.395 67.465C11.825 64.845 10 59.71 10 50C10 46.185 10.02 42.175 10.85 39.12C11.26 37.62 11.805 36.59 12.435 35.955ZM15 30C13.075 30 10 27.86 10 22.5C10 21.635 10.26 20.265 10.78 18.715C11.2539 17.2517 11.9072 15.8527 12.725 14.55C13.16 13.815 13.725 13.1 14.335 12.445C14.68 13.055 15.135 13.67 15.735 14.27C16.1 14.635 16.575 15.075 16.98 15.455L17.6 16.035C18.125 16.545 18.53 16.99 18.855 17.485C19.455 18.38 20 19.735 20 22.5C20 27.86 16.925 30 15 30Z"
            fill="#C9212E"
        />
    </svg>
);

const iconGraphicalData = (
    <svg
        xmlns="http://www.w3.org/2000/svg"
        width="80"
        height="80"
        viewBox="0 0 80 80"
        fill="none"
    >
        <path
            d="M69.9996 75H54.9996C53.6739 74.9987 52.4029 74.4715 51.4655 73.5341C50.5281 72.5967 50.0009 71.3257 49.9996 70V55C50.0009 53.6743 50.5281 52.4033 51.4655 51.4659C52.4029 50.5285 53.6739 50.0013 54.9996 50H69.9996C71.3253 50.0013 72.5963 50.5285 73.5337 51.4659C74.4711 52.4033 74.9983 53.6743 74.9996 55V70C74.9983 71.3257 74.4711 72.5967 73.5337 73.5341C72.5963 74.4715 71.3253 74.9987 69.9996 75ZM54.9996 55V70H69.9996V55H54.9996ZM44.9996 65H29.9996C28.0111 64.998 26.1046 64.2072 24.6985 62.8011C23.2924 61.395 22.5016 59.4885 22.4996 57.5V47.5H27.4996V57.5C27.5003 58.1628 27.7639 58.7983 28.2326 59.267C28.7013 59.7357 29.3368 59.9993 29.9996 60H44.9996V65ZM64.9996 45H59.9996V37.5C59.999 36.8372 59.7353 36.2017 59.2667 35.733C58.798 35.2643 58.1625 35.0007 57.4996 35H44.9996V30H57.4996C59.4881 30.002 61.3946 30.7928 62.8007 32.1989C64.2068 33.605 64.9976 35.5115 64.9996 37.5V45ZM37.4996 45C37.0638 45.0003 36.6354 44.8865 36.2571 44.67L24.9996 38.22L13.7421 44.67C13.3199 44.9118 12.8363 45.0251 12.3506 44.996C11.865 44.967 11.3983 44.7969 11.0079 44.5065C10.6175 44.2162 10.3203 43.8182 10.1527 43.3615C9.98519 42.9047 9.95457 42.4089 10.0646 41.935L12.7171 30.505L5.67212 22.955C5.3642 22.6246 5.15153 22.217 5.05671 21.7754C4.96188 21.3339 4.98844 20.8749 5.13356 20.4472C5.27868 20.0195 5.53695 19.6391 5.88092 19.3464C6.2249 19.0538 6.64172 18.8598 7.08712 18.785L17.5871 17.03L22.7521 6.405C22.9553 5.98792 23.2705 5.63561 23.6625 5.38747C24.0545 5.13933 24.5078 5.00516 24.9717 4.99997C25.4356 4.99478 25.8918 5.11878 26.2892 5.35809C26.6867 5.59739 27.0097 5.94257 27.2221 6.355L32.7321 17.03L42.9246 18.785C43.369 18.8616 43.7844 19.0569 44.1268 19.3504C44.4691 19.6438 44.7258 20.0243 44.8695 20.4517C45.0133 20.8791 45.0388 21.3374 44.9433 21.7781C44.8478 22.2188 44.6349 22.6254 44.3271 22.955L37.2821 30.505L39.9321 41.935C40.0171 42.3014 40.0184 42.6822 39.9358 43.0491C39.8532 43.416 39.6888 43.7595 39.455 44.0541C39.2212 44.3487 38.924 44.5868 38.5854 44.7505C38.2469 44.9143 37.8757 44.9996 37.4996 45ZM24.9996 32.5C24.9996 32.5 25.8571 32.95 26.2421 33.1725L33.7671 37.4825L31.8071 29.04L37.5121 22.9275L29.4296 21.535L25.0671 13.08L20.9571 21.535L12.5046 22.9475L18.1896 29.04L16.2296 37.4825L23.7546 33.1725C24.1446 32.95 24.9996 32.5 24.9996 32.5Z"
            fill="#C9212E"
        />
    </svg>
);

const iconBaselineDeveloperMode = (
    <svg
        xmlns="http://www.w3.org/2000/svg"
        width="80"
        height="80"
        viewBox="0 0 80 80"
        fill="none"
    >
        <path
            d="M23.333 16.6666H56.6663V23.3333H63.333V9.99998C63.333 6.33331 60.333 3.36665 56.6663 3.36665L23.333 3.33331C19.6663 3.33331 16.6663 6.33331 16.6663 9.99998V23.3333H23.333V16.6666ZM51.3663 55.3L66.6663 40L51.3663 24.7L46.6663 29.4333L57.233 40L46.6663 50.5667L51.3663 55.3ZM33.333 50.5667L22.7663 40L33.333 29.4333L28.633 24.7L13.333 40L28.633 55.3L33.333 50.5667ZM56.6663 63.3333H23.333V56.6666H16.6663V70C16.6663 73.6666 19.6663 76.6666 23.333 76.6666H56.6663C60.333 76.6666 63.333 73.6666 63.333 70V56.6666H56.6663V63.3333Z"
            fill="#C9212E"
        />
    </svg>
);

const Card = ({ icon, title, text }) => {
    return (
        <div className="services-card">
            <div className="services-card-icon">{icon}</div>
            <h3 className="services-card-title">{title}</h3>
            <p className="services-card-text">{text}</p>
        </div>
    );
};

const Services = () => {
    return (
        <section
            className="services padding-x bg-blue margin-bottom"
            id="services"
        >
            <h2 className="section-title-white">خدمتنا</h2>
            <p className="services-text">
                كل الخدمات التي تحتاجونها في مكان واحد وبأيد أمينة
            </p>
            <Swiper
                spaceBetween={10}
                centeredSlides={true}
                slidesPerView={1}
                // loop={true}
                breakpoints={{
                    1600: {
                        slidesPerView: 4,
                        spaceBetween: 30,
                    },
                    1000: {
                        slidesPerView: 3,
                        spaceBetween: 20,
                    },
                    800: {
                        slidesPerView: 2,
                        spaceBetween: 10,
                    },
                }}
                autoplay={{
                    delay: 2500,
                    disableOnInteraction: false,
                }}
                pagination={{
                    clickable: true,
                }}
                navigation={true}
                modules={[Autoplay, Pagination, Navigation]}
                className="mySwiper"
            >
                <SwiperSlide>
                    <Card
                        icon={iconDesignIdeas}
                        title="التصميم الجرافك"
                        text="غلافات صفحات الفيسبوك, قنوات اليوتيوب, تصميم اعلانات لمنتجك, دعم تصاميم ثلاثية الابعاد, متاح جميع الاحجام"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconGraphicalData}
                        title="تصميم واجهة المستخدم"
                        text="التصميم المرئي للواجهة الرقمية للبرامج أو التطبيقات أو مواقع الويب و تشمل ضبط الخصائص المرئية والتفاعلية للمنتجات الرقمية"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconBaselineDeveloperMode}
                        title="برمجة التطبقيات"
                        text="تصميم جذاب , يدعم جميع الاجهزة الاندرويد و الايفون بكل الاصدارات ، حق تملك كامل ل السورس كود, دعم ٢٤ ساعة"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconGraphicalData}
                        title="تصميم واجهة المستخدم"
                        text="التصميم المرئي للواجهة الرقمية للبرامج أو التطبيقات أو مواقع الويب و تشمل ضبط الخصائص المرئية والتفاعلية للمنتجات الرقمية"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconBaselineDeveloperMode}
                        title="برمجة التطبقيات"
                        text="تصميم جذاب , يدعم جميع الاجهزة الاندرويد و الايفون بكل الاصدارات ، حق تملك كامل ل السورس كود, دعم ٢٤ ساعة"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconBaselineDeveloperMode}
                        title="برمجة التطبقيات"
                        text="تصميم جذاب , يدعم جميع الاجهزة الاندرويد و الايفون بكل الاصدارات ، حق تملك كامل ل السورس كود, دعم ٢٤ ساعة"
                    />
                </SwiperSlide>
            </Swiper>
        </section>
    );
};

export default Services;

/*

<Swiper
                spaceBetween={10}
                centeredSlides={true}
                slidesPerView={3}
                direction="rtl"
                
                autoplay={{
                    delay: 2500,
                    disableOnInteraction: false,
                }}
                pagination={{
                    clickable: true,
                }}
                navigation={true}
                modules={[Autoplay, Pagination, Navigation]}
                className="mySwiper services-swiper-container"
            >
                <SwiperSlide>
                    <Card
                        icon={iconDesignIdeas}
                        title="التصميم الجرافك"
                        text="غلافات صفحات الفيسبوك, قنوات اليوتيوب, تصميم اعلانات لمنتجك, دعم تصاميم ثلاثية الابعاد, متاح جميع الاحجام"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconGraphicalData}
                        title="تصميم واجهة المستخدم"
                        text="التصميم المرئي للواجهة الرقمية للبرامج أو التطبيقات أو مواقع الويب و تشمل ضبط الخصائص المرئية والتفاعلية للمنتجات الرقمية"
                    />
                </SwiperSlide>

                <SwiperSlide>
                    <Card
                        icon={iconBaselineDeveloperMode}
                        title="برمجة التطبقيات"
                        text="تصميم جذاب , يدعم جميع الاجهزة الاندرويد و الايفون بكل الاصدارات ، حق تملك كامل ل السورس كود, دعم ٢٤ ساعة"
                    />
                </SwiperSlide>
            </Swiper>

*/
